backend/controllers/CJobfinderController.php

    protected function findModel($id)
    {
        if (($model = CJobfinder::findOne($id)) !== null) {
---
SELECT * FROM `c_jobfinder` WHERE `jobfinder_id`='9'