backend/controllers/CJobcategoryController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => CJobcategory::find()->asArray()->all(),
        ]);
---
SELECT * FROM `c_jobcategory`