backend/controllers/MLanguageController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => MLanguage::find()->asArray()->all(),
        ]);
---
SELECT * FROM `m_language`