backend/controllers/MLocationController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => MLocation::find()->asArray()->all(),
        ]);
---
SELECT * FROM `m_location`