frontend/views/candidate/_form_resume.php

SELECT * FROM `s_seeker`
SELECT * FROM `m_language`
SELECT * FROM `s_highesdegree`
SELECT * FROM `c_yearexperience`
SELECT * FROM `c_jobcategory`
SELECT * FROM `c_explevel`
SELECT * FROM `m_location`
---
use common\models\CExplevel;
use common\models\MLocation;

$SSeeker = ArrayHelper::map(SSeeker::find()->all(), 'seek_id', 'seek_name');
$MLanguage = ArrayHelper::map(MLanguage::find()->all(), 'language_id', 'language_name');
$SHighesdegree = ArrayHelper::map(SHighesdegree::find()->all(), 'hdegree_id', 'hdegree_name');
$CYearexperience = ArrayHelper::map(CYearexperience::find()->all(), 'yearexp_id', 'yearexp_value');
$CJobcategory = ArrayHelper::map(CJobcategory::find()->all(), 'jobcategory_id', 'jobcategory_name');
$CExplevel = ArrayHelper::map(CExplevel::find()->all(), 'explevel_id', 'explevel_name');
$MLocation = ArrayHelper::map(MLocation::find()->all(), 'location_id', 'location_name');