backend/views/c-jobfinder/_form.php

use common\models\CJobcategory;
use common\models\MLocation;

$CSalaryoffer = ArrayHelper::map(CSalaryoffer::find()->all(), 'salaryoffer_id', 'salaryoffer_value');
$CExplevel = ArrayHelper::map(CExplevel::find()->all(), 'explevel_id', 'explevel_name');
$CYearexperience = ArrayHelper::map(CYearexperience::find()->all(), 'yearexp_id', 'yearexp_value');
$CAcdegree = ArrayHelper::map(CAcdegree::find()->all(), 'acdegree_id', 'acdegree_name');
$CDresscode = ArrayHelper::map(CDresscode::find()->all(), 'dresscode_id', 'dresscode_name');
$CTimecategory = ArrayHelper::map(CTimecategory::find()->all(), 'timecategory_id', 'timecategory_name');
$CJobcategory = ArrayHelper::map(CJobcategory::find()->all(), 'jobcategory_id', 'jobcategory_name');
$CCompany = ArrayHelper::map(CCompany::find()->all(), 'company_id', 'company_name');
$MLocation = ArrayHelper::map(MLocation::find()->all(), 'location_id', 'location_name');
---
SELECT * FROM `c_salaryoffer`
SELECT * FROM `c_explevel`
SELECT * FROM `c_yearexperience`
SELECT * FROM `c_acdegree`
SELECT * FROM `c_dresscode`
SELECT * FROM `c_timecategory`
SELECT * FROM `c_jobcategory`
SELECT * FROM `c_company`
SELECT * FROM `m_location`