frontend/controllers/BlogController.php

    public function actionIndex()
    {
        $itemPerPage = 4;
        $itemCount = count(BPost::find()->all());

        if (isset($_GET['page']) AND !empty($_GET['page'])) {
            $_GET['page'] = intval($_GET['page']);
            $pageCounter = $_GET['page'];
        }else{
            $pageCounter = 1;
        }
        $offsetPart = ($pageCounter - 1) * $itemPerPage;

        // $pageCounter = $pageCounter;
        $pageTotal = ceil($itemCount/$itemPerPage);

        $contents = BPost::find()
        ->limit($itemPerPage)
        ->offset($offsetPart)
        ->asArray()->all();

        $contentslist = BPost::find()->limit(6)->asArray()->all();
        $categories = BCategory::find()->asArray()->all();
---
SELECT * FROM `b_post`
SELECT * FROM `b_post` LIMIT 4
SELECT * FROM `b_post` LIMIT 6
SELECT * FROM `b_category`