frontend/controllers/CandidateController.php

SELECT * FROM `s_seeker` WHERE `seek_id_user`=48
---
	public function actionCreateResume()
    {
        $model = new SResume();
        $id_candidate = Yii::$app->user->identity->id;
        $sel_seeker = SSeeker::find()->where(['seek_id_user'=>$id_candidate])->asArray()->one();