frontend/controllers/CompanyController.php

	public function actionManageApp()
    {
        $id_user = Yii::$app->user->identity->id;
        $sel_company = CCompany::find()->where(['company_id_user'=>$id_user])->asArray()->one();
        $all_app = Vapplication::find()->where(['company_id'=>$sel_company['company_id'], 'app_status'=>'p'])->asArray()->all();
---
SELECT * FROM `c_company` WHERE `company_id_user`=2
SELECT * FROM `vapplication` WHERE (`company_id`='1') AND (`app_status`='p')