frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $jobcategory = CJobcategory::find()->asArray()->all();
        $joblocation = MLocation::find()->asArray()->all();
        $features = BFeature::find()->limit(6)->orderBy(['feature_id'=>SORT_DESC])->asArray()->all();
        $blogs = BPost::find()->joinWith(['blogIdCategory'])->limit(6)->orderBy(['blog_id'=>SORT_DESC])->asArray()->all();
        $testimonial = BTestimonial::find()->limit(6)->orderBy(['testimonial_id'=>SORT_DESC])->asArray()->all();
        $recentjob = CJobfinder::find()
        ->joinWith([
            'jobfinderTimecategory',
            'jobfinderIdCompany',
            'jobfinderLocation',
        ])
        ->limit(4)->orderBy(['jobfinder_updatedat'=>SORT_DESC])
        ->where(['jobfinder_statuspost'=>'r'])
        ->asArray()->all();
---
SELECT * FROM `c_jobcategory`
SELECT * FROM `b_feature` ORDER BY `feature_id` DESC LIMIT 6
SELECT * FROM `b_testimonial` ORDER BY `testimonial_id` DESC LIMIT 6
SELECT `c_jobfinder`.* FROM `c_jobfinder` LEFT JOIN `c_timecategory` ON `c_jobfinder`.`jobfinder_timecategory` = `c_timecategory`.`timecategory_id` LEFT JOIN `c_company` ON `c_jobfinder`.`jobfinder_id_company` = `c_company`.`company_id` WHERE `jobfinder_statuspost`='r' ORDER BY `jobfinder_updatedat` DESC LIMIT 4

    public function actionCompanylist()
    {
        $get = Yii::$app->request->get();
        if (!empty($_GET['company_name'])){
            // var_dump($post);
            $query = CCompany::find();

            if ($get['company_name'] != null) {
                $query->andWhere(['LIKE','company_name', $get['company_name']]);
            }
            $resultSearch = $query->asArray()->all();

            return $this->render('list_search',[
                    'resultSearch' => $resultSearch,
                ]);
        }else{
            $itemPerPage = 7;
            $itemCount = count(CCompany::find()->all());

            if (isset($_GET['page']) AND !empty($_GET['page'])) {
                $_GET['page'] = intval($_GET['page']);
                $pageCounter = $_GET['page'];
            }else{
                $pageCounter = 1;
            }
            $offsetPart = ($pageCounter - 1) * $itemPerPage;

            $data['pageCounter'] = $pageCounter;
            $data['pageTotal'] = ceil($itemCount/$itemPerPage);

            $data['all_company'] = CCompany::find()->asArray()->all();
---
SELECT * FROM `c_company`
SELECT * FROM `c_company` WHERE `company_name` LIKE '%good%'

    public function actionCompanyDetail($id)
    {
        $itemPerPage = 4;
        $itemCount = count(CJobfinder::find()->where(['jobfinder_statuspost'=>'r','jobfinder_id_company'=>$id])->all());

        if (isset($_GET['page']) AND !empty($_GET['page'])) {
            $_GET['page'] = intval($_GET['page']);
            $pageCounter = $_GET['page'];
        }else{
            $pageCounter = 1;
        }
        $offsetPart = ($pageCounter - 1) * $itemPerPage;

        $data['pageCounter'] = $pageCounter;
        $data['pageTotal'] = ceil($itemCount/$itemPerPage);
        $data['countJobs'] = CJobfinder::find()->where(['jobfinder_statuspost'=>'r'])->all();

        $data['sel_company'] = CCompany::find()->where(['company_id'=>$id])->asArray()->one();

        $data['com_jobs'] = CJobfinder::find()
        ->joinWith([
            'jobfinderTimecategory',
            'jobfinderLocation',
        ])->limit($itemPerPage)
        ->offset($offsetPart)
        ->where([
            'jobfinder_statuspost'=>'r',
            'jobfinder_id_company'=>$id,
        ])
        ->asArray()->all();
---
SELECT * FROM `c_jobfinder` WHERE `jobfinder_statuspost`='r'
SELECT * FROM `c_company` WHERE `company_id`='1'
SELECT `c_jobfinder`.* FROM `c_jobfinder` LEFT JOIN `c_timecategory` ON `c_jobfinder`.`jobfinder_timecategory` = `c_timecategory`.`timecategory_id` LEFT JOIN `c_company` ON `c_jobfinder`.`jobfinder_id_company` = `c_company`.`company_id` WHERE `jobfinder_statuspost`='r' LIMIT 7 OFFSET 7

    public function actionJoblist()
    {
        $get = Yii::$app->request->get();

        if (!empty($_GET['jobfinder_jobname']) || !empty($_GET['jobfinder_category']) || !empty($_GET['jobfinder_timecategory']) || !empty($_GET['jobfinder_salaryoffer']) || !empty($_GET['jobfinder_explvl']) || !empty($_GET['jobfinder_acdegree']) || !empty($_GET['jobfinder_dresscode'])){
            // var_dump($post);
            $query = CJobfinder::find()->where(['jobfinder_statuspost'=>'r']);

            if ($get['jobfinder_jobname'] != null) {
                $query->andWhere(['LIKE','jobfinder_jobname', $get['jobfinder_jobname']]);
            }
            if ($get['jobfinder_category'] != null) {
                $query->andWhere(['LIKE','jobfinder_category', $get['jobfinder_category']]);
            }
            if ($get['jobfinder_timecategory'] != null) {
                $query->andWhere(['LIKE','jobfinder_timecategory', $get['jobfinder_timecategory']]);
            }
            if ($get['jobfinder_salaryoffer'] != null) {
                $query->andWhere(['LIKE','jobfinder_salaryoffer', $get['jobfinder_salaryoffer']]);
            }
            if ($get['jobfinder_explvl'] != null) {
                $query->andWhere(['LIKE','jobfinder_explvl', $get['jobfinder_explvl']]);
            }
            if ($get['jobfinder_acdegree'] != null) {
                $query->andWhere(['LIKE','jobfinder_acdegree', $get['jobfinder_acdegree']]);
            }
            if ($get['jobfinder_dresscode'] != null) {
                $query->andWhere(['LIKE','jobfinder_dresscode', $get['jobfinder_dresscode']]);
            }
            $resultSearch = $query->joinWith(['jobfinderTimecategory','jobfinderIdCompany','jobfinderLocation'])->asArray()->all();
---
SELECT `c_jobfinder`.* FROM `c_jobfinder` LEFT JOIN `c_timecategory` ON `c_jobfinder`.`jobfinder_timecategory` = `c_timecategory`.`timecategory_id` LEFT JOIN `c_company` ON `c_jobfinder`.`jobfinder_id_company` = `c_company`.`company_id` LEFT JOIN `m_location` ON `c_jobfinder`.`jobfinder_location` = `m_location`.`location_id` WHERE ((`jobfinder_statuspost`='r') AND (`jobfinder_category` LIKE '%1%')) AND (`jobfinder_salaryoffer` LIKE '%1%')

    public function actionResumelist()
    {
        $get = Yii::$app->request->get();

        if (!empty($_GET['res_title']) || !empty($_GET['res_category']) || !empty($_GET['res_id_yearexp']) || !empty($_GET['res_id_hidegree']) || !empty($_GET['res_joblocation'])){
            // var_dump($post);
            $query = SResume::find()->where(['res_statuspost'=>'r']);

            if ($get['res_title'] != null) {
                $query->andWhere(['LIKE','res_title', $get['res_title']]);
            }
            if ($get['res_category'] != null) {
                $query->andWhere(['LIKE','res_category', $get['res_category']]);
            }
            if ($get['res_id_yearexp'] != null) {
                $query->andWhere(['LIKE','res_id_yearexp', $get['res_id_yearexp']]);
            }
            if ($get['res_id_hidegree'] != null) {
                $query->andWhere(['LIKE','res_id_hidegree', $get['res_id_hidegree']]);
            }
            if ($get['res_joblocation'] != null) {
                $query->andWhere(['LIKE','res_joblocation', $get['res_joblocation']]);
            }

            $resultSearch = $query->joinWith(['resIdSeek','resIdJobcategory','resJoblocation'])->asArray()->all();
---
SELECT `s_resume`.* FROM `s_resume` LEFT JOIN `s_seeker` ON `s_resume`.`res_id_seek` = `s_seeker`.`seek_id` LEFT JOIN `c_jobcategory` ON `s_resume`.`res_id_jobcategory` = `c_jobcategory`.`jobcategory_id` LEFT JOIN `m_location` ON `s_resume`.`res_joblocation` = `m_location`.`location_id` WHERE (`res_statuspost`='r') AND (`res_title` LIKE '%res%')

                ]);
        }else{
            $itemPerPage = 8;
            $itemCount = count(SResume::find()->where(['res_statuspost'=>'r'])->all());
---
SELECT * FROM `s_resume` WHERE `res_statuspost`='r'

            $data['pageCounter'] = $pageCounter;
            $data['pageTotal'] = ceil($itemCount/$itemPerPage);

            $data['all_resume'] = SResume::find()->joinWith(['resIdSeek','resIdJobcategory','resJoblocation'])->limit($itemPerPage)->offset($offsetPart)->where(['res_statuspost'=>'r'])->asArray()->all();

            $data['all_yexp'] = CYearexperience::find()->asArray()->all();
            $data['all_jobcategory'] = CJobcategory::find()->asArray()->all();
            $data['all_hdegree'] = SHighesdegree::find()->asArray()->all();
            $data['joblocation'] = MLocation::find()->asArray()->all();
---
SELECT `s_resume`.* FROM `s_resume` LEFT JOIN `s_seeker` ON `s_resume`.`res_id_seek` = `s_seeker`.`seek_id` LEFT JOIN `c_jobcategory` ON `s_resume`.`res_id_jobcategory` = `c_jobcategory`.`jobcategory_id` LEFT JOIN `m_location` ON `s_resume`.`res_joblocation` = `m_location`.`location_id` WHERE `res_statuspost`='r' LIMIT 8
SELECT * FROM `c_yearexperience`
SELECT * FROM `c_jobcategory`
SELECT * FROM `s_highesdegree`
SELECT * FROM `m_location`