frontend/controllers/SiteController.php

SELECT * FROM `c_company`
---
    public function actionCompanylist()
    {
        $itemPerPage = 7;
        $itemCount = count(CCompany::find()->all());

SELECT `s_resume`.* FROM `s_resume` LEFT JOIN `s_seeker` ON `s_resume`.`res_id_seek` = `s_seeker`.`seek_id` LEFT JOIN `user` ON `s_seeker`.`seek_id_user` = `user`.`id` LEFT JOIN `c_jobcategory` ON `s_resume`.`res_id_jobcategory` = `c_jobcategory`.`jobcategory_id` LEFT JOIN `s_highesdegree` ON `s_resume`.`res_id_hidegree` = `s_highesdegree`.`hdegree_id` LEFT JOIN `c_yearexperience` ON `s_resume`.`res_id_yearexp` = `c_yearexperience`.`yearexp_id` LEFT JOIN `c_explevel` ON `s_resume`.`res_id_joblevel` = `c_explevel`.`explevel_id` LEFT JOIN `m_language` ON `s_resume`.`res_id_language` = `m_language`.`language_id` WHERE `res_id`='5'
SELECT * FROM `s_education` WHERE `edu_id_res`='5' ORDER BY `edu_start`
SELECT * FROM `s_workexperience` WHERE `work_id_res`='5' ORDER BY `work_start`
SELECT * FROM `s_skillsummary` WHERE `skill_id_res`='5'
---
    public function actionResumeDetail($id)
    {
        $sel_resume = SResume::find()
        ->joinWith([
            'resIdSeek',
            'resIdSeek.seekIdUser',
            'resIdJobcategory',
            'resIdHidegree',
            'resIdYearexp',
            'resIdJobcategory',
            'resIdJoblevel',
            'resIdLanguage'
        ])
        ->where(['res_id'=>$id])
        ->asArray()->one();

        $all_edu = SEducation::find()->where(['edu_id_res'=>$id])->orderBy(['edu_start'=>SORT_ASC])->asArray()->all();
        $all_work = SWorkexperience::find()->where(['work_id_res'=>$id])->orderBy(['work_start'=>SORT_ASC])->asArray()->all();
        $all_skill = SSkillsummary::find()->where(['skill_id_res'=>$id])->asArray()->all();

SELECT * FROM `s_education` WHERE `edu_id_res`='5' ORDER BY `edu_start`
SELECT * FROM `s_workexperience` WHERE `work_id_res`='5' ORDER BY `work_start`
SELECT * FROM `s_skillsummary` WHERE `skill_id_res`='5'
---
    public function actionResumePrint($id)
    {
        $sel_resume = SResume::find()
        ->joinWith([
            'resIdSeek',
            'resIdSeek.seekIdUser',
            'resIdJobcategory',
            'resIdHidegree',
            'resIdYearexp',
            'resIdJobcategory',
            'resIdJoblevel',
            'resIdLanguage'
        ])
        ->where(['res_id'=>$id])
        ->asArray()->one();

        $all_edu = SEducation::find()->where(['edu_id_res'=>$id])->orderBy(['edu_start'=>SORT_ASC])->asArray()->all();
        $all_work = SWorkexperience::find()->where(['work_id_res'=>$id])->orderBy(['work_start'=>SORT_ASC])->asArray()->all();
        $all_skill = SSkillsummary::find()->where(['skill_id_res'=>$id])->asArray()->all();