frontend/views/layouts/main.php

SELECT `seek_id`, `seek_picture` FROM `s_seeker` WHERE `seek_id_user`=48
---
											<span class="profile-name"><?=Yii::$app->user->identity->username?></span>
											<span class="profile-avatar">
											<?php if(Yii::$app->user->identity->role == 3){?>
												<?php $sel_seeker = SSeeker::find()->select(['seek_id', 'seek_picture'])->where(['seek_id_user'=>$id_user])->asArray()->one(); ?>

SELECT `company_id`, `company_logo` FROM `c_company` WHERE `company_id_user`=2
---
									                    Html::img(Yii::getAlias('@web')."/uploads/seeker/seek_picture/".$sel_seeker['seek_id']."/".$sel_seeker['seek_picture'], ['alt'=>'myImage','width'=>'100','height'=>'100'])
												?>
											<?php } else if(Yii::$app->user->identity->role == 2){?>
												<?php $sel_company = CCompany::find()->select(['company_id', 'company_logo'])->where(['company_id_user'=>$id_user])->asArray()->one(); ?>